In [1]:
import pandas as pd
import numpy as np
import datetime as dt

# importer les 3 tables

In [2]:
chemin='c:\\users\\nassc\\Desktop\\'
data_customers = pd.read_csv(chemin+'customers.csv')
data_transactions = pd.read_csv(chemin+'transactions.csv')
data_products = pd.read_csv(chemin+'products.csv')

# Nettoyer les données

# A) La table clients

In [3]:
data_customers

     client_id sex  birth
0       c_4410   f   1967
1       c_7839   f   1975
2       c_1699   f   1984
3       c_5961   f   1962
4       c_5320   m   1943
...        ...  ..    ...
8618    c_7920   m   1956
8619    c_7403   f   1970
8620    c_5119   m   1974
8621    c_5643   f   1968
8622      c_84   f   1982

[8623 rows x 3 columns]

In [4]:
# informations sur la table
data_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

In [5]:
# Chercher les valeurs doublons :
len(data_customers['client_id'].unique())

8623

In [6]:
# Chercher les valeurs manquantes :
data_customers['client_id'].isnull().sum()

0

In [7]:
data_customers['birth'].count()

8623

In [8]:
data_customers['birth'].value_counts()

2004    440
1979    215
1988    207
1986    203
1978    199
       ...
1935      8
1932      6
1931      4
1930      4
1929      3
Name: birth, Length: 76, dtype: int64

In [9]:
# Chercher les valeurs manquantes
data_customers['birth'].isnull().sum()

0

In [10]:
data_customers['sex'].count()

8623

In [11]:
# Chercher les valeurs manquantes
data_customers['sex'].isnull().sum()

0

In [12]:
data_customers['birth'].max()

2004

In [13]:
data_customers['birth'].min()

1929

# B) la table transactions :

In [14]:
data_transactions

       id_prod                        date session_id client_id
0       0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450
1        2_226  2022-02-03 01:55:53.276402   s_159142     c_277
2        1_374  2021-09-23 15:13:46.938559    s_94290    c_4270
3       0_2186  2021-10-17 03:27:18.783634   s_105936    c_4597
4       0_1351  2021-07-17 20:34:25.800563    s_63642    c_1242
...        ...                         ...        ...       ...
337011   1_671  2021-05-28 12:35:46.214839    s_40720    c_3454
337012   0_759  2021-06-19 00:19:23.917703    s_50568    c_6268
337013  0_1256  2021-03-16 17:31:59.442007     s_7219    c_4137
337014   2_227  2021-10-30 16:50:15.997750   s_112349       c_5
337015  0_1417  2021-06-26 14:38:19.732946    s_54117    c_6714

[337016 rows x 4 columns]

In [15]:
# informations sur la table
data_transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 337016 entries, 0 to 337015
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     337016 non-null  object
 1   date        337016 non-null  object
 2   session_id  337016 non-null  object
 3   client_id   337016 non-null  object
dtypes: object(4)
memory usage: 10.3+ MB

In [16]:
data_transactions['id_prod'].value_counts()

1_369     1081
1_417     1062
1_498     1036
1_414     1027
1_425     1013
          ...
2_23         1
0_1842       1
0_1728       1
0_433        1
0_1279       1
Name: id_prod, Length: 3266, dtype: int64

In [17]:
# Chercher les valeurs doublons :
len(data_transactions['id_prod'].unique())

3266

In [18]:
# Chercher les valeurs manquantes
data_transactions['id_prod'].isnull().sum()

0

In [19]:
data_transactions['date'].count()

337016

In [20]:
# Chercher les valeurs doublons :
len(data_transactions['date'].unique())

336855

In [21]:
# Chercher les valeurs manquantes
data_transactions['date'].isnull().sum()

0

In [22]:
data_transactions['session_id'].count()

337016

In [23]:
# Chercher les valeurs doublons :
len(data_transactions['session_id'].unique())

169195

In [24]:
# Chercher les valeurs manquantes
data_transactions['session_id'].isnull().sum()

0

In [25]:
data_transactions['client_id'].count()

337016

In [26]:
data_transactions['client_id'].value_counts()

c_1609    12855
c_6714     4473
c_3454     3275
c_4958     2562
c_7959      195
          ...
c_4478        1
c_4648        1
c_6837        1
c_1232        1
c_7089        1
Name: client_id, Length: 8602, dtype: int64

In [27]:
# Chercher les valeurs doublons :
len(data_transactions['client_id'].unique())

8602

In [28]:
# Chercher les valeurs manquantes :
data_transactions['client_id'].isnull().sum()

0

# C) La table des produits

In [29]:
data_products

     id_prod   price  categ
0     0_1421   19.99      0
1     0_1368    5.13      0
2      0_731   17.99      0
3      1_587    4.99      1
4     0_1507    3.99      0
...      ...     ...    ...
3282    2_23  115.99      2
3283   0_146   17.14      0
3284   0_802   11.22      0
3285   1_140   38.56      1
3286  0_1920   25.16      0

[3287 rows x 3 columns]

In [30]:
# Informations sur la table :
data_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3287 entries, 0 to 3286
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3287 non-null   object
 1   price    3287 non-null   float64
 2   categ    3287 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 77.2+ KB

In [31]:
len(data_products['id_prod'].unique())

3287

In [32]:
data_products['price'].max()

300.0

In [33]:
data_products['price'].min()

-1.0

In [34]:
# indicateurs statistiques sur les valeurs :
data_products .describe()

             price        categ
count  3287.000000  3287.000000
mean     21.856641     0.370246
std      29.847908     0.615387
min      -1.000000     0.000000
25%       6.990000     0.000000
50%      13.060000     0.000000
75%      22.990000     1.000000
max     300.000000     2.000000

In [35]:
# valeur aberrante:prix négatif
data_products[data_products['price']==-1]

    id_prod  price  categ
731     T_0   -1.0      0

In [36]:
# déterminer les éléments aberrants :
data_transaber=data_transactions[data_transactions['id_prod']=='T_0']

In [37]:
data_transaber

       id_prod                             date session_id client_id
1431       T_0  test_2021-03-01 02:30:02.237420        s_0      ct_1
2365       T_0  test_2021-03-01 02:30:02.237446        s_0      ct_1
2895       T_0  test_2021-03-01 02:30:02.237414        s_0      ct_1
5955       T_0  test_2021-03-01 02:30:02.237441        s_0      ct_0
7283       T_0  test_2021-03-01 02:30:02.237434        s_0      ct_1
...        ...                              ...        ...       ...
332594     T_0  test_2021-03-01 02:30:02.237445        s_0      ct_0
332705     T_0  test_2021-03-01 02:30:02.237423        s_0      ct_1
332730     T_0  test_2021-03-01 02:30:02.237421        s_0      ct_1
333442     T_0  test_2021-03-01 02:30:02.237431        s_0      ct_1
335279     T_0  test_2021-03-01 02:30:02.237430        s_0      ct_0

[200 rows x 4 columns]

In [38]:
# supprimer les éléménts (les lignes) abérrants :
data_products1=data_products[data_products['id_prod']!='T_0']

In [39]:
data_products1

     id_prod   price  categ
0     0_1421   19.99      0
1     0_1368    5.13      0
2      0_731   17.99      0
3      1_587    4.99      1
4     0_1507    3.99      0
...      ...     ...    ...
3282    2_23  115.99      2
3283   0_146   17.14      0
3284   0_802   11.22      0
3285   1_140   38.56      1
3286  0_1920   25.16      0

[3286 rows x 3 columns]

In [40]:
data_products1.describe()

             price        categ
count  3286.000000  3286.000000
mean     21.863597     0.370359
std      29.849786     0.615446
min       0.620000     0.000000
25%       6.990000     0.000000
50%      13.075000     0.000000
75%      22.990000     1.000000
max     300.000000     2.000000

In [41]:
len(data_products1['id_prod'].unique())

3286

In [42]:
data_products1['price'].isnull().sum()

0

In [43]:
data_products1['price'].describe()

count    3286.000000
mean       21.863597
std        29.849786
min         0.620000
25%         6.990000
50%        13.075000
75%        22.990000
max       300.000000
Name: price, dtype: float64

# supprimer les clients test de la table client

In [44]:
# Supprimer les clients à valeurs aberrantes(test):
data_clients=data_customers[data_customers['client_id']!='ct_0']

In [45]:
data_clients.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8622 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8622 non-null   object
 1   sex        8622 non-null   object
 2   birth      8622 non-null   int64
dtypes: int64(1), object(2)
memory usage: 269.4+ KB

In [46]:
data_clients1=data_clients[data_clients['client_id']!='ct_1']

In [47]:
data_clients1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8621 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8621 non-null   object
 1   sex        8621 non-null   object
 2   birth      8621 non-null   int64
dtypes: int64(1), object(2)
memory usage: 269.4+ KB

In [48]:
data_clients1

     client_id sex  birth
0       c_4410   f   1967
1       c_7839   f   1975
2       c_1699   f   1984
3       c_5961   f   1962
4       c_5320   m   1943
...        ...  ..    ...
8618    c_7920   m   1956
8619    c_7403   f   1970
8620    c_5119   m   1974
8621    c_5643   f   1968
8622      c_84   f   1982

[8621 rows x 3 columns]

In [49]:
data_clients1['birth'].describe()

count    8621.000000
mean     1978.275606
std        16.917958
min      1929.000000
25%      1966.000000
50%      1979.000000
75%      1992.000000
max      2004.000000
Name: birth, dtype: float64

# Supprimer les valeurs aberrantes(test) dans la table transactions

In [50]:
data_transactions1=data_transactions[data_transactions['id_prod']!='T_0']

In [51]:
data_transactions1

       id_prod                        date session_id client_id
0       0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450
1        2_226  2022-02-03 01:55:53.276402   s_159142     c_277
2        1_374  2021-09-23 15:13:46.938559    s_94290    c_4270
3       0_2186  2021-10-17 03:27:18.783634   s_105936    c_4597
4       0_1351  2021-07-17 20:34:25.800563    s_63642    c_1242
...        ...                         ...        ...       ...
337011   1_671  2021-05-28 12:35:46.214839    s_40720    c_3454
337012   0_759  2021-06-19 00:19:23.917703    s_50568    c_6268
337013  0_1256  2021-03-16 17:31:59.442007     s_7219    c_4137
337014   2_227  2021-10-30 16:50:15.997750   s_112349       c_5
337015  0_1417  2021-06-26 14:38:19.732946    s_54117    c_6714

[336816 rows x 4 columns]

In [52]:
data_transactions1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 336816 entries, 0 to 337015
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     336816 non-null  object
 1   date        336816 non-null  object
 2   session_id  336816 non-null  object
 3   client_id   336816 non-null  object
dtypes: object(4)
memory usage: 12.8+ MB

# Changer le format dates de catégorie (object) au datetime dans la table transactions :

In [53]:
data_transactions1['date'] = pd.to_datetime(data_transactions1['date'], format='%Y-%m-%d %H:%M:%S',errors='coerce')

<ipython-input-53-d890affe30f2>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_transactions1['date'] = pd.to_datetime(data_transactions1['date'], format='%Y-%m-%d %H:%M:%S',errors='coerce')

In [54]:
data_transactions1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 336816 entries, 0 to 337015
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     336816 non-null  object
 1   date        336816 non-null  datetime64[ns]
 2   session_id  336816 non-null  object
 3   client_id   336816 non-null  object
dtypes: datetime64[ns](1), object(3)
memory usage: 12.8+ MB

In [55]:
data_transactions1['date']

0        2021-04-10 18:37:28.723910
1        2022-02-03 01:55:53.276402
2        2021-09-23 15:13:46.938559
3        2021-10-17 03:27:18.783634
4        2021-07-17 20:34:25.800563
                    ...
337011   2021-05-28 12:35:46.214839
337012   2021-06-19 00:19:23.917703
337013   2021-03-16 17:31:59.442007
337014   2021-10-30 16:50:15.997750
337015   2021-06-26 14:38:19.732946
Name: date, Length: 336816, dtype: datetime64[ns]

# Vérifier les tables entre elles:

# créer une table clients et transactions

In [56]:
data_trans_clients=data_transactions1.merge(data_clients1[['client_id','sex','birth']],how='left',on=['client_id'])

In [57]:
data_trans_clients

       id_prod                       date session_id client_id sex  birth
0       0_1483 2021-04-10 18:37:28.723910    s_18746    c_4450   f   1977
1        2_226 2022-02-03 01:55:53.276402   s_159142     c_277   f   2000
2        1_374 2021-09-23 15:13:46.938559    s_94290    c_4270   f   1979
3       0_2186 2021-10-17 03:27:18.783634   s_105936    c_4597   m   1963
4       0_1351 2021-07-17 20:34:25.800563    s_63642    c_1242   f   1980
...        ...                        ...        ...       ...  ..    ...
336811   1_671 2021-05-28 12:35:46.214839    s_40720    c_3454   m   1969
336812   0_759 2021-06-19 00:19:23.917703    s_50568    c_6268   m   1991
336813  0_1256 2021-03-16 17:31:59.442007     s_7219    c_4137   f   1968
336814   2_227 2021-10-30 16:50:15.997750   s_112349       c_5   f   1994
336815  0_1417 2021-06-26 14:38:19.732946    s_54117    c_6714   f   1968

[336816 rows x 6 columns]

In [58]:
data_trans_clients.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 336816 entries, 0 to 336815
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     336816 non-null  object
 1   date        336816 non-null  datetime64[ns]
 2   session_id  336816 non-null  object
 3   client_id   336816 non-null  object
 4   sex         336816 non-null  object
 5   birth       336816 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 18.0+ MB

In [59]:
len(data_trans_clients['client_id'].unique())

8600

In [60]:
data_trans_clients['client_id'].value_counts()

c_1609    12855
c_6714     4473
c_3454     3275
c_4958     2562
c_2140      195
          ...
c_712         1
c_7089        1
c_1624        1
c_6397        1
c_4223        1
Name: client_id, Length: 8600, dtype: int64

In [61]:
data_trans_clients['birth'].count()

336816

In [62]:
len(data_trans_clients['client_id'].unique())

8600

In [63]:
len(data_trans_clients['id_prod'].unique())

3265

In [64]:
data_trans_clients['client_id'].isnull().sum()

0

# créer une table produits et transactions :

In [65]:
data_trans_prod1=data_transactions1.merge(data_products1[['id_prod','price','categ']],how='left',on=['id_prod'])

In [66]:
data_trans_prod1

       id_prod                       date session_id client_id  price  categ
0       0_1483 2021-04-10 18:37:28.723910    s_18746    c_4450   4.99    0.0
1        2_226 2022-02-03 01:55:53.276402   s_159142     c_277  65.75    2.0
2        1_374 2021-09-23 15:13:46.938559    s_94290    c_4270  10.71    1.0
3       0_2186 2021-10-17 03:27:18.783634   s_105936    c_4597   4.20    0.0
4       0_1351 2021-07-17 20:34:25.800563    s_63642    c_1242   8.99    0.0
...        ...                        ...        ...       ...    ...    ...
336811   1_671 2021-05-28 12:35:46.214839    s_40720    c_3454  31.99    1.0
336812   0_759 2021-06-19 00:19:23.917703    s_50568    c_6268  22.99    0.0
336813  0_1256 2021-03-16 17:31:59.442007     s_7219    c_4137  11.03    0.0
336814   2_227 2021-10-30 16:50:15.997750   s_112349       c_5  50.99    2.0
336815  0_1417 2021-06-26 14:38:19.732946    s_54117    c_6714  17.99    0.0

[336816 rows x 6 columns]

In [67]:
data_trans_prod1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 336816 entries, 0 to 336815
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     336816 non-null  object
 1   date        336816 non-null  datetime64[ns]
 2   session_id  336816 non-null  object
 3   client_id   336816 non-null  object
 4   price       336713 non-null  float64
 5   categ       336713 non-null  float64
dtypes: datetime64[ns](1), float64(2), object(3)
memory usage: 18.0+ MB

In [68]:
len(data_trans_prod1['id_prod'].unique())

3265

In [69]:
#valeurs manquantes
data_trans_prod1['price'].isnull().sum()

103

In [70]:
# rechercher les lignes valeurs manquantes :
data_trans_prod1.loc[data_trans_prod1['price'].isnull()]

       id_prod                       date session_id client_id  price  categ
6231    0_2245 2021-06-17 03:03:12.668129    s_49705    c_1533    NaN    NaN
10797   0_2245 2021-06-16 05:53:01.627491    s_49323    c_7954    NaN    NaN
14045   0_2245 2021-11-24 17:35:59.911427   s_124474    c_5120    NaN    NaN
17480   0_2245 2022-02-28 18:08:49.875709   s_172304    c_4964    NaN    NaN
21071   0_2245 2021-03-01 00:09:29.301897        s_3     c_580    NaN    NaN
...        ...                        ...        ...       ...    ...    ...
322523  0_2245 2021-04-06 19:59:19.462288    s_16936    c_4167    NaN    NaN
329226  0_2245 2021-03-30 23:29:02.347672    s_13738    c_7790    NaN    NaN
330297  0_2245 2021-12-03 14:14:40.444177   s_128815    c_6189    NaN    NaN
335331  0_2245 2021-04-27 18:58:47.703374    s_26624    c_1595    NaN    NaN
336020  0_2245 2021-05-01 03:35:03.146305    s_28235    c_5714    NaN    NaN

[103 rows x 6 columns]

In [71]:
data_trans_prod1[data_trans_prod1['id_prod']=='0_2245']

       id_prod                       date session_id client_id  price  categ
6231    0_2245 2021-06-17 03:03:12.668129    s_49705    c_1533    NaN    NaN
10797   0_2245 2021-06-16 05:53:01.627491    s_49323    c_7954    NaN    NaN
14045   0_2245 2021-11-24 17:35:59.911427   s_124474    c_5120    NaN    NaN
17480   0_2245 2022-02-28 18:08:49.875709   s_172304    c_4964    NaN    NaN
21071   0_2245 2021-03-01 00:09:29.301897        s_3     c_580    NaN    NaN
...        ...                        ...        ...       ...    ...    ...
322523  0_2245 2021-04-06 19:59:19.462288    s_16936    c_4167    NaN    NaN
329226  0_2245 2021-03-30 23:29:02.347672    s_13738    c_7790    NaN    NaN
330297  0_2245 2021-12-03 14:14:40.444177   s_128815    c_6189    NaN    NaN
335331  0_2245 2021-04-27 18:58:47.703374    s_26624    c_1595    NaN    NaN
336020  0_2245 2021-05-01 03:35:03.146305    s_28235    c_5714    NaN    NaN

[103 rows x 6 columns]

In [72]:
#rechercher le produit 'id_prod'=0_2245 dans la table produit: 
data_products1[data_products1['id_prod']=='0_2245']

Empty DataFrame
Columns: [id_prod, price, categ]
Index: []

# reponse: le produit n'existe pas,
# introduire le produit dans la table produits et corriger le prix avec une valeur de la médiane des prix

In [73]:
# selectionner les produits de la table de catégorie '0'
data_price_categ0=data_products1[data_products1['categ']==0.0]

In [74]:
data_price_categ0

     id_prod  price  categ
0     0_1421  19.99      0
1     0_1368   5.13      0
2      0_731  17.99      0
4     0_1507   3.99      0
5     0_1163   9.99      0
...      ...    ...    ...
3280  0_1314  20.63      0
3281   0_607  14.99      0
3283   0_146  17.14      0
3284   0_802  11.22      0
3286  0_1920  25.16      0

[2308 rows x 3 columns]

In [75]:
data_price_categ0.describe()

             price   categ
count  2308.000000  2308.0
mean     11.732795     0.0
std       7.565755     0.0
min       0.620000     0.0
25%       5.587500     0.0
50%      10.320000     0.0
75%      16.655000     0.0
max      40.990000     0.0

In [76]:
#Introduire le produit dans la table produits avec le prix median des catégories '0'
data_products2=data_products1.append({'id_prod':'0_2245','price':10.32,'categ':0},ignore_index=True)

In [77]:
data_products2.describe()

             price        categ
count  3287.000000  3287.000000
mean     21.860085     0.370246
std      29.845922     0.615387
min       0.620000     0.000000
25%       6.990000     0.000000
50%      13.060000     0.000000
75%      22.990000     1.000000
max     300.000000     2.000000

In [78]:
# créer une table produits (products2) et transactions:
data_trans_prod=data_transactions1.merge(data_products2[['id_prod','price','categ']],how='left',on=['id_prod'])

In [79]:
data_trans_prod

       id_prod                       date session_id client_id  price  categ
0       0_1483 2021-04-10 18:37:28.723910    s_18746    c_4450   4.99      0
1        2_226 2022-02-03 01:55:53.276402   s_159142     c_277  65.75      2
2        1_374 2021-09-23 15:13:46.938559    s_94290    c_4270  10.71      1
3       0_2186 2021-10-17 03:27:18.783634   s_105936    c_4597   4.20      0
4       0_1351 2021-07-17 20:34:25.800563    s_63642    c_1242   8.99      0
...        ...                        ...        ...       ...    ...    ...
336811   1_671 2021-05-28 12:35:46.214839    s_40720    c_3454  31.99      1
336812   0_759 2021-06-19 00:19:23.917703    s_50568    c_6268  22.99      0
336813  0_1256 2021-03-16 17:31:59.442007     s_7219    c_4137  11.03      0
336814   2_227 2021-10-30 16:50:15.997750   s_112349       c_5  50.99      2
336815  0_1417 2021-06-26 14:38:19.732946    s_54117    c_6714  17.99      0

[336816 rows x 6 columns]

In [80]:
data_trans_prod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 336816 entries, 0 to 336815
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     336816 non-null  object
 1   date        336816 non-null  datetime64[ns]
 2   session_id  336816 non-null  object
 3   client_id   336816 non-null  object
 4   price       336816 non-null  float64
 5   categ       336816 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 18.0+ MB

In [81]:
len(data_trans_prod['id_prod'].unique())

3265

In [82]:
#valeurs manquantes
data_trans_prod['price'].isnull().sum()

0

In [83]:
len(data_trans_prod['client_id'].unique())

8600

# exporter les fichiers pour l'analyse

In [84]:
chemin='c:\\users\\nassc\\Desktop\\'

In [85]:

data_products2.to_csv(chemin+'data_products2.csv')

In [86]:
data_trans_clients.to_csv(chemin+'data_trans_clients.csv')

In [87]:
data_trans_prod.to_csv(chemin+'data_trans_prod.csv')